app/views/users/index.html.erb

<div class="index_pictures">
    <%if Picture.all.count > 16 %>
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]