app/views/users/show.html.erb

  <br>
<h1 class="username_profile"> <%= @user.username %></h1> <h4 class="following_list"><%=link_to " #{total_followers.count} Followers #{total_followeds.count} Following", following_path(@user.id), {:style => 'text-decoration: none; color: white; display: block; padding: 15px; margin: auto; font-family: Ubuntu; font-size: 1.5vw;'}%></h4>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Tomtom"], ["LIMIT", 1]]


<%if @user.pictures.empty? && @user.id == current_user.id%>
---
SELECT  1 AS one FROM "pictures" WHERE "pictures"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "pictures".* FROM "pictures" WHERE "pictures"."user_id" = ? ORDER BY "pictures"."created_at" ASC  [["user_id", 1]]