app/views/tags/show.html.erb

<h1>Here are some <%=@tag.name%> pics!</h1>
<% @tag.pictures.each do |picture| %>
---
SELECT "pictures".* FROM "pictures" INNER JOIN "picture_tags" ON "pictures"."id" = "picture_tags"."picture_id" WHERE "picture_tags"."tag_id" = ?  [["tag_id", 1]]