app/views/pictures/new.html.erb

SELECT "tags".* FROM "tags"
---
    <br>
    <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name do |b| %>