app/views/pictures/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "picture_tags" ON "tags"."id" = "picture_tags"."tag_id" WHERE "picture_tags"."picture_id" = ?  [["picture_id", 12]]
---
<%end%>
<p>tags: </p><% @picture.tags.reject {|c| c.name.empty?}.each do |tag|%><p>

SELECT COUNT(*) FROM "reactions" WHERE "reactions"."picture_id" = ? AND (reaction_key = 'happy')  [["picture_id", 2]]
---

<%= @picture.reactions.where("reaction_key = 'happy'").count %>