app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    if @comment.save
---
INSERT INTO "comments" ("content", "picture_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "cute pic"], ["picture_id", 6], ["user_id", 1], ["created_at", "2017-09-12 18:20:07.749528"], ["updated_at", "2017-09-12 18:20:07.749528"]]

  def destroy
    @comment = Comment.find(params[:id])
    @picture = @comment.picture
    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 13]]