app/controllers/followings_controller.rb

  def create
    @following = Following.new(following_params)
    # @following.followed_id = @user.id
    # @following.follower_id = current_user.id
    if @following.save
---
INSERT INTO "followings" ("followed_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["followed_id", 3], ["follower_id", 7], ["created_at", "2017-09-13 17:29:01.333200"], ["updated_at", "2017-09-13 17:29:01.333200"]]