app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("image_url", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @picture = Picture.new(picture_params)
    @picture.user_id = current_user.id
    if @picture.save

DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 7]]
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def destroy
    Picture.find(params[:id]).destroy