app/controllers/reactions_controller.rb

  def create
    @reaction = Reaction.new
    @picture = Picture.find(params[:reaction][:picture_id])
    @reaction.picture_id = params[:reaction][:picture_id]
    @reaction.user_id = current_user.id
    @reaction.reaction_key = params[:reaction][:reaction_key]
    if @reaction.save
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reactions" ("user_id", "picture_id", "reaction_key") VALUES (?, ?, ?)  [["user_id", 2], ["picture_id", 2], ["reaction_key", "happy"]]