app/controllers/users_controller.rb

INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Tomtom"], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(username: params[:id])

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$fIlhPk6qVk5BOaa4GOrHD.qmDMzv28wkkKABe68UA9I5h5OvvvR7y"], ["updated_at", "2017-09-11 19:54:07.524559"], ["id", 3]]
---
  def update
    @user = User.find_by(username: params[:id])
    if @user.update(profile_pic: params[:user][:profile_pic])

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "MikeMac"], ["LIMIT", 1]]
---
  def destroy
    User.find_by(username: params[:id]).destroy